START_BUTTON = "start"
START_REPLAY = (
    "Привет!\nЯ помогу тебе управлять твоим компьютером.\nВыбери функцию:\n"
)
VOLUME = "🔉Громкость"
VOLUME_BUTTON_CLICK = "volume_click"

TELEGRAM_BOT_TOKEN = "TELEGRAM_BOT_TOKEN"

PERSENT = 100

CHANGE_TO_VOLUME = (
    "Меню управления громкостью\n\n"
    "Громкость сейчас: {volume}%\n\n"
    "Если хочешь изменить, выберите значение"
)

CANCEL_BUTTON_TEXT = "Отмена"
CANCEL_BUTTON_CLICK = "cancel"
CANCEL_CONFIRM_TEXT = "Хорошо, операция отменена"

CHANGE_VOLUME = "change_volume_"
MUTE_VOLUME_TEXT = "Выключить звук"

SUCSESS_TEXT = (
    "Операция выполнена!\n\n"
    "Уровень громкости сейчас {volume}%\n\n"
    "Выбери функцию:\n\n"
)
SUCSESS_VOLUME_TEXT = "Уровень громкости изменен на: {volume}%"

FALSE_TEXT = "Произошла ошибка. Не удалось выполнить операцию"

MONITOR = "🖥 Экран"
MONITOR_BUTTON_CLICK = "monitor"

NIGHT_SWITCH_TEXT = "🌙 Ночной режим"
CHANGE_BRIGHTNESS = "change_brightness_"

CHANGE_TO_BRIGHTNESS = (
    "Меню управления яркостью\n\n"
    "Яркость сейчас: {brightness}%\n\n"
    "Если хочешь изменить, выберите значение"
)

SUCSESS_BRIGHTNESS_TEXT = "Уровень громкости изменен на: {brightness}%"
SUCSESS_BRIGHTNESS_MESSAGE = (
    "Операция выполнена!\n\n"
    "Уровень яркости сейчас {brightness}%\n\n"
    "Выбери функцию:\n\n"
)
