START_BUTTON = "start"
START_REPLAY = (
    "Привет!\nЯ помогу тебе управлять твоим компьютером.\nВыбери функцию:\n"
)
VOLUME = "🔉Громкость"
VOLUME_BUTTON_CLICK = "volume_click"

TELEGRAM_BOT_TOKEN = "TELEGRAM_BOT_TOKEN"

PERCENT = 100

CHANGE_TO_VOLUME = (
    "Меню управления громкостью\n\n"
    "Громкость сейчас: {volume}%\n\n"
    "Если хочешь изменить, выбери значение\n"
)

CANCEL_BUTTON_TEXT = "🔙 Отмена"
CANCEL_BUTTON_CLICK = "cancel"
CANCEL_CONFIRM_TEXT = "Хорошо, операция отменена"

CHANGE_VOLUME = "change_volume_"
MUTE_VOLUME_TEXT = "Выключить звук"

SUCCESS_TEXT = (
    "Операция выполнена!\n\n"
    "Уровень громкости сейчас: {volume}%\n\n"
    "Выбери функцию:\n\n"
)
SUCCESS_VOLUME_TEXT = "Уровень громкости изменен на: {volume}%"

FALSE_TEXT = "Произошла ошибка. Не удалось выполнить операцию"

MONITOR = "🖥 Экран"
MONITOR_BUTTON_CLICK = "monitor"

NIGHT_SWITCH_TEXT = "🌙 Ночной режим"
CHANGE_BRIGHTNESS = "change_brightness_"

CHANGE_TO_BRIGHTNESS = (
    "Меню управления яркостью\n\n"
    "Яркость сейчас: {brightness}%\n\n"
    "Если хочешь изменить, выбери значение\n"
)

SUCCESS_BRIGHTNESS_TEXT = "Уровень громкости изменен на: {brightness}%"
SUCCESS_BRIGHTNESS_MESSAGE = (
    "Операция выполнена!\n\n"
    "Уровень яркости сейчас: {brightness}%\n\n"
    "Выбери функцию:\n\n"
)
POWER = "🔌 Электропитание"
POWER_BUTTON_CLICK = "power"

SHUTDOWN_NOW = "Выключить сейчас"
CHANGE_SHUTDOWN = "change_shutdown_"
CANCEL_SHUTDOWN_TEXT = "Отменить выключение"
CANCEL_SHUTDOWN = "cancel_shutdown"

CHANGE_TO_POWER = (
    "Меню управления электропитанием\n\n"
    "Сейчас таймер не установлен\n\n"
    "Если хочешь установить, выбери время\n"
)

SUCCESS_SHUTDOWN_TEXT = "Таймер успешно установлен!"

ADMIN_IDS = "ADMIN_IDS"

ACCESS_DENIED = "Доступ запрещен."

SUCCESS_SHUTDOWN_MESSAGE = (
    "Операция выполнена!\n\n"
    "Компьютер будет выключен в {finish_time}\n\n"
    "Выбери функцию:\n\n"
)

SUCCESS_CANCEL_SHUTDOWN_TEXT = "Выключение отменено!"

SUCCESS_CANCEL_SHUTDOWN_MESSAGE = (
    "Выключение отменено\n\n" "Выбери функцию:\n\n"
)

CHANGE_TO_POWER_TIMER = (
    "Меню управления электропитанием\n"
    "Сейчас таймер установлен\n\n"
    "Компьютер выключится в {time}\n"
    "Осталось примерно - {minutes}\n\n"
    "Можешь отменить\n"
)
